RhinoInside.Revit API Documentation
GeometryDecoder.ToCurve Method (CurveLoop)
 Converts the specified CurveLoop to an equivalent Rhino Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8017
Syntax
public static Curve ToCurve(
	this CurveLoop value
)
Parameters
value
Type: CurveLoop
A value to convert.
Return Value
Type: Curve
A Rhino Curve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type CurveLoop. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace